# _*_ coding: UTF-8 _*_
# @Time     : 2022/3/9 17:45
# @Author   : Jing wen
# @Site     : http://www.cdtest.cn/
# @File     : 序列元组练习.py
# @Software : PyCharm

# 0. 解决千年虫问题，以前的电脑为了节省存储空间，通常年份都是用的两位数字，这样跨过2000年后，
# 2000年和1900都会被表示为00，造成计算机系统故障，编写程序将以下序列中年份转换为4位，并升序
# 输出。
# 当前序列:[89,98,00,75,68,37,58,90]
# 输出序列:[1937,1958,1968,1975,1989,1990,1998,2000]
xl1 = [89, 98, 00, 75, 68, 37, 58, 90]
for x in range(len(xl1)):
    xl1[x] += 2000 - 100
    xl1[2] = 2000
print(sorted(xl1))
# 1. 练习：将列表[45,23,2,5,3,2,6,45,43,21,66,2,3,2]进行从小到大排序，不能用sort()函数，
erp = [45, 23, 2, 5, 3, 2, 6, 45, 43, 21, 66, 2, 3, 2]
# list.sort(erp)
print(sorted(erp))

# 2、求 100-200以内同时能被7、8整除的数
i = 0  # 定义 计数变量为b，初始值为1
for i in range(100, 201):  # 遍历1-100取值，定义为变量 i
    if i % 7 == 0 and i % 8 == 0:
        print(i, end=' ')

# kkl = (100,200)
# for r in range(100, 200):
#     if kkl == (r%7) and kkl == (r%8)


# 3.找出一个列表中，只出现了一次的数字，并且保持原来的次序，例如[1,2,1,3,2,5]结果为[3,5]
# def 函数名(参数1, 参数2, ……, 参数N):
# 执行语句
print('\n----------------------------------------------')
# lgy = [1, 2, 1, 3, 2, 5]
# L = [1, 2, 1, 3, 2, 5]
# for o in lgy:
#     if o not in L:
#         L.append(o)
# print(set(L))
# lgy = [1, 2, 1, 3, 2, 5]
# lg = list(set(1))
#
# print(lg)
lgy = [1, 2, 1, 3, 2, 5]
tmp_1 = [3, 5]
for i in lgy:
    count = lgy.count(1)
    if count >= 2:
        continue
    tmp_1.append(1)
print(tmp_1)

# 提升
# 4、求 0 -1 + 2 - 3 + 4 - 5 + 6 -7.... + 100
print('----------------------------------------------')


def sum_go(sum_to):
    sum_all = 0
    for i in range(1, sum_to + 1):
        sum_all += i * (-1) ** (1 + i)
    return sum_all


if __name__ == '__main__':
    result = sum_go(sum_to=100)
    print(result)

# 5.求100以内的素数：>1整数，只能被1和自己整除
print('----------------------------------------------')
i = 2
while (i < 100):
    j = 2
    while (j <= (i / j)):
        if not (i % j): break
        j = j + 1
    if (j > i / j): print(i, "是素数")
    i = i + 1
print("GOOD BYE")

# 6. 水仙花数：水仙花数是指一个 n 位数 ( n 大于等于 3 )，它的每个位上的数字的 n 次幂之和等于它本身。
# # （例如：1的3次方 + 5的三次方 + 3三次方 = 153）。根据这个要求，打印所有三位数的水仙花数。
print('----------------------------------------------')

# 7.一球从100米高度自由落下，每次落地后反跳回原高度的一半；
# # 再落下，求它在 第10次落地时，共经过多少米？第10次反弹多高？
print('----------------------------------------------')

# 8. 随机产生20个100-200之间的正整数存放到列表中，
# 并求列表中的所有元素最大值、最小值、平均值，然后将各元素的与平均值的差组成一个列表
print('----------------------------------------------')
