# _*_ coding: UTF-8 _*_
# @Time     : 2022/3/9 17:45
# @Author   : Jing wen
# @Site     : http://www.cdtest.cn/
# @File     : 序列元组练习.py
# @Software : PyCharm

# 0. 解决千年虫问题，以前的电脑为了节省存储空间，通常年份都是用的两位数字，这样跨过2000年后，
# 2000年和1900都会被表示为00，造成计算机系统故障，编写程序将以下序列中年份转换为4位，并升序
# 输出。
# 当前序列:[89,98,00,75,68,37,58,90]
# 输出序列:[1937,1958,1968,1975,1989,1990,1998,2000]

# 1. 练习：将列表[45,23,2,5,3,2,6,45,43,21,66,2,3,2]进行从小到大排序，不能用sort()函数，


# 2、求 100-200以内同时能被7、8整除的数


# 3.找出一个列表中，只出现了一次的数字，并且保持原来的次序，例如[1,2,1,3,2,5]结果为[3,5]
print('\n----------------------------------------------')


# 提升
# 4、求 0 -1 + 2 - 3 + 4 - 5 + 6 -7.... + 100
print('----------------------------------------------')


# 5.求100以内的素数：>1整数，只能被1和自己整除
print('----------------------------------------------')


# 6. 水仙花数：水仙花数是指一个 n 位数 ( n 大于等于 3 )，它的每个位上的数字的 n 次幂之和等于它本身。
# # （例如：1的3次方 + 5的三次方 + 3三次方 = 153）。根据这个要求，打印所有三位数的水仙花数。
print('----------------------------------------------')


# 7.一球从100米高度自由落下，每次落地后反跳回原高度的一半；
# # 再落下，求它在 第10次落地时，共经过多少米？第10次反弹多高？
print('----------------------------------------------')


# 8. 随机产生20个100-200之间的正整数存放到列表中，
# 并求列表中的所有元素最大值、最小值、平均值，然后将各元素的与平均值的差组成一个列表
print('----------------------------------------------')